# Dotfiles - VP Engineering Brewfile
# Run: brew bundle --file=~/.dotfiles/Brewfile
# Updated: 2026-02-09

tap "homebrew/bundle"
tap "homebrew/cask-fonts"

###############################################################################
# CLI Essentials                                                               #
###############################################################################

brew "git"
brew "gh"
brew "gh-copilot"           # GitHub Copilot CLI
brew "starship"             # Shell prompt
brew "zsh-syntax-highlighting"
brew "zsh-autosuggestions"
brew "tldr"                 # Simplified man pages
brew "mas"                  # Mac App Store CLI
brew "atuin"                # Magical shell history
brew "aider"                # AI pair programmer
brew "mods"                 # Pipe to LLM

###############################################################################
# Modern CLI Tools                                                             #
###############################################################################

brew "bat"                  # cat replacement
brew "fd"                   # find replacement
brew "fzf"                  # fuzzy finder
brew "ripgrep"              # grep replacement
brew "zoxide"               # cd replacement
brew "eza"                  # ls replacement (includes tree functionality)
brew "jq"                   # JSON processor
brew "httpie"               # HTTP client
brew "lazygit"              # Git TUI
brew "direnv"               # Per-directory env vars

###############################################################################
# Development                                                                  #
###############################################################################

brew "fnm"                  # Fast Node Manager
brew "python"
brew "uv"                   # Modern Python package manager
brew "diff-so-fancy"        # Better git diffs
brew "shellcheck"           # Shell script linter

###############################################################################
# Media (Production Use)                                                       #
###############################################################################

brew "ffmpeg"               # Video processing for demos
brew "imagemagick"          # Image manipulation

###############################################################################
# Essential Apps                                                               #
###############################################################################

cask "1password"            # Password manager
cask "visual-studio-code"   # Primary editor
cask "docker-desktop"       # Containers
cask "notion"               # Notes & documentation

###############################################################################
# AI & Productivity (VP Engineering)                                           #
###############################################################################

cask "claude"               # AI assistant
cask "codex"                # OpenAI Codex CLI
cask "raycast"              # Spotlight replacement with AI
cask "grammarly-desktop"    # Writing assistant
cask "cursor"               # AI-first code editor
cask "ollama"               # Local LLM runner
cask "arc"                  # Browser (complement to Dia)

# Manual installations required (not in Homebrew):
# → Dia Browser: https://www.diabrowser.com
# → Antigravity: Google IDE
# → Perplexity: https://www.perplexity.ai/download
# → Speechify: https://speechify.com/download
# → Comet Browser (Perplexity AI Browser): https://www.perplexity.ai/comet

###############################################################################
# Development Tools                                                            #
###############################################################################

cask "postman"              # API testing
cask "tableplus"            # Database GUI
cask "warp"                 # AI-enabled terminal
cask "figma"                # Design collaboration

###############################################################################
# Team Communication                                                           #
###############################################################################

cask "discord"
cask "signal"
cask "whatsapp"
cask "zoom"
cask "linear-linear"        # Modern project management

###############################################################################
# Utilities                                                                    #
###############################################################################

cask "vlc"                  # Media player
cask "google-drive"         # Cloud storage

###############################################################################
# Fonts                                                                        #
###############################################################################

cask "font-fira-code-nerd-font"
cask "font-jetbrains-mono-nerd-font"  # Alternative coding font

###############################################################################
# Optional - Uncomment if needed                                               #
###############################################################################

# cask "google-chrome"      # Additional browser
# cask "spotify"            # Music
# cask "obsidian"           # Alternative to Notion
# cask "slack"              # If company uses Slack
# brew "k9s"                # Kubernetes management TUI
# brew "ollama"             # Local LLM testing
