# Shell enhancements
brew "starship"
brew "fzf"
brew "eza"
brew "bat"
brew "asdf"

# Homebrew tap for bun (JavaScript runtime)
tap "oven-sh/bun"

# Terminal utilities and UX
brew "ripgrep"
brew "tree"

# Networking and HTTP
brew "http-server"
brew "ssh-copy-id"

# Core developer tooling
brew "git"
brew "gh"
brew "stow"
brew "jq"

# Development tools
brew "nvm"
brew "bun"

# Databases
brew "postgresql"

# Documentation / Markdown preview
brew "grip"

# Casks – Browsers
cask "google-chrome", greedy: true
cask "microsoft-edge"       # Edge
cask "arc"                  # Arc Browser


# Casks – Editors & Dev tools
cask "visual-studio-code"   # VS Code
cask "iterm2"

# Casks – Productivity & Utilities
cask "notion"
cask "deepl"
cask "1password"
cask "whatsapp"
cask "slack"
cask "zoom"
cask "obsidian"

# Mac App Store – Productivity & notes
mas "Grammarly: AI Writing and Grammar", id: 1462114288
mas "Bear – Markdown Notes", id: 1091189122
mas "Evernote – Notes Organizer", id: 406056744
mas "Todoist: To-Do List & Planner", id: 585829637
mas "Trello: organize anything!", id: 1278508951

# Mac App Store – Apple iWork suite
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541

# Mac App Store – Development
mas "Xcode", id: 497799835
