tap "goles/battery"
tap "homebrew/bundle"
tap "homebrew/core"
tap "lotyp/homebrew-formulae"
tap "oven-sh/bun"

# core/dotfiles
brew "awscli"
brew "bats-core"
brew "coreutils"
brew "lotyp/formulae/dockutil"
brew "mackup"
brew "mas"
brew "nano"
brew "saml2aws"
brew "stow"
brew "topgrade"

# fs/network
brew "bat"
brew "croc"
brew "httpie"
brew "ssh-copy-id"
brew "tree"
brew "unar"
brew "wget"
brew "zoxide"

# search/grep/diff
brew "diff-so-fancy"
brew "difftastic"
brew "fd"
brew "fzf"
brew "gnu-sed"
brew "grep"
brew "jq"
brew "psgrep"
brew "the_silver_searcher"

# languages/tools
brew "fnm"
brew "gh"
brew "python"
brew "rust"
brew "shellcheck"

# media
brew "ffmpeg"
brew "imagemagick"
brew "webp"

# misc
brew "grip"

brew "gnupg"
brew "goles/battery/battery"
brew "http-server"
# brew "spaceship"
brew "pure"
brew "bun"


mas 'Feedly', id: 865500966
mas 'Keynote', id: 409183694
mas 'Numbers', id: 409203825
mas 'Pages', id: 409201541
mas 'Pocket', id: 568494494
mas 'todoist', id: 585829637
mas 'Trello', id: 1278508951
mas 'TweetDeck', id: 485812721
mas 'Xcode', id: 497799835
mas "amazon-prime-video", id: 545519333
mas "bear-markdown-notes", id: 1091189122
mas "day-one", id: 1055511498
mas "evernote", id: 406056744
mas "garageband", id: 682658836
mas "imovie", id: 408981434
mas "LINE", id: 539883307
mas "magnet", id: 441258766
