tap "goles/battery"
tap "homebrew/bundle"
tap "homebrew/core"

brew "fasd"
brew "ffmpeg"
brew "gh"
brew "gnu-sed"
brew "gnupg"
brew "goles/battery/battery"
brew "grep"
brew "grip"
brew "httpie"
brew "http-server"
brew "imagemagick"
brew "jq"
brew "mackup"
brew "psgrep"
brew "python"
brew "shellcheck"
brew "spaceship"
brew "stow"
brew "thefuck"
brew "tree"
brew "wget"

mas 'Feedly', id: 865500966
mas 'Keynote', id: 409183694
mas 'Numbers', id: 409203825
mas 'Pages', id: 409201541
mas 'Pocket', id: 568494494
mas 'todoist', id: 585829637
mas 'Trello', id: 1278508951
mas 'TweetDeck', id: 485812721
mas 'Twitter', id: 333903271
mas 'Xcode', id: 497799835
mas "LINE", id: 539883307
mas "magnet", id: 441258766
mas "Slack", id: 803453959
mas "amazon-prime-video", id: 545519333
mas "bear-markdown-notes", id: 1091189122
mas "day-one", id: 1055511498
mas "evernote", id: 406056744
mas "garageband", id: 682658836
mas "imovie", id: 408981434
mas "line", id: 539883307
mas "telegram", id: 747648890
