tap "goles/battery"
tap "homebrew/bundle"
tap "homebrew/core"

brew "fasd"
brew "ffmpeg"
brew "gh"
brew "gnu-sed"
brew "gnupg"
brew "goles/battery/battery"
brew "grep"
brew "grip"
brew "httpie"
brew "http-server"
brew "imagemagick"
brew "jq"
brew "mackup"
brew "psgrep"
brew "python"
brew "shellcheck"
brew "spaceship"
brew "stow"
brew "thefuck"
brew "tree"
brew "wget"

mas 'Feedly', id: 865500966
mas 'Keynote', id: 409183694
mas 'Numbers', id: 409203825
mas 'Pages', id: 409201541
mas 'Pocket', id: 568494494
mas 'todoist', id: 585829637
mas 'Trello', id: 1278508951
mas 'TweetDeck', id: 485812721
mas 'Twitter', id: 1482454543
mas 'Unsplash Wallpapers', id: 1284863847
mas 'WebP Converter', id: 1522368690
mas 'Xcode', id: 497799835
mas "LINE", id: 539883307
mas "magnet", id: 441258766
mas "Slack", id: 803453959
max "amazon-prime-video" id: 545519333
max "bear-markdown-notes" id: 1091189122
max "day-one" id: 1055511498
max "evernote-notes-organizer" id: 281796108
max "garageband" id: 408709785
max "google-docs-sync-edit-share" id: 842842640
max "google-sheets" id: 842849113
max "google-slides" id: 879478102
max "imovie" id: 377298193
max "line" id: 443904275
max "telegram-messenger" id: 686449807
